Reports/ВедомостьАмортизацииНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ВедомостьАмортизацииНМА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияНМА</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииНМА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПродукцииРаботДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/СтоимостьНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьНМА</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Амортизация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияНМА</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийНМА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестонахождениеНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеНМА</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений Работники</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСостоянийНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыСостоянийНМА</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ВедомостьАмортизацииНМА/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	// не выводим общие
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок.Вставить("Общие", 1);

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаНач"                   , ОбщийОтчет.ДатаНач);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаКон"                   , КонецДня(ОбщийОтчет.ДатаКон));
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СостояниеВводВЭксплуатацию", Перечисления.ВидыСостоянийНМА.ПринятКУчету);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СостояниеСписание"         , Перечисления.ВидыСостоянийНМА.Списан);
	
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	Текст =
	"ВЫБРАТЬ
	|	ПервоначальныеСведения.НематериальныйАктив               КАК НематериальныйАктив,
	|	ПервоначальныеСведения.НематериальныйАктив.Представление КАК НематериальныйАктивПредставление,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации       КАК СпособНачисления,
	|	СостояниеНМАПрием.Период                                 КАК ДатаВводаВЭксплуатацию,
	|	СостояниеНМАСписание.Период                              КАК ДатаСписания,
	|	СУММА(ПервоначальныеСведения.ПервоначальнаяСтоимость)    КАК ПервоначальнаяСтоимость,
	|	СУММА(СтоимостьНМА.СтоимостьКонечныйОстаток) 
	|		- СУММА(СтоимостьНМА.АмортизацияКонечныйОстаток)     КАК ОстаточнаяСтоимость,
	|	СУММА(ПервоначальныеСведения.ЛиквидационнаяСтоимость)    КАК ЛиквидационнаяСтоимость,
	|	СУММА(СтоимостьНМА.СтоимостьНачальныйОстаток)            КАК СтоимостьНачальныйОстаток,
	|	СУММА(СтоимостьНМА.СтоимостьПриход)                      КАК СтоимостьПриход,
	|	СУММА(СтоимостьНМА.СтоимостьРасход)                      КАК СтоимостьРасход,
	|	СУММА(СтоимостьНМА.СтоимостьОборот)                      КАК СтоимостьОборот,
	|	СУММА(СтоимостьНМА.СтоимостьКонечныйОстаток)             КАК СтоимостьКонечныйОстаток,
	|	СУММА(СтоимостьНМА.АмортизацияНачальныйОстаток)          КАК АмортизацияНачальныйОстаток,
	|	СУММА(СтоимостьНМА.АмортизацияПриход)                    КАК АмортизацияПриход,
	|	СУММА(СтоимостьНМА.АмортизацияРасход)                    КАК АмортизацияРасход,
	|	СУММА(СтоимостьНМА.АмортизацияОборот)                    КАК АмортизацияОборот,
	|	СУММА(СтоимостьНМА.АмортизацияКонечныйОстаток)           КАК АмортизацияКонечныйОстаток,
	|	МестонахождениеНМА.МОЛ КАК МОЛ,
	|	МестонахождениеНМА.Местонахождение КАК Подразделение
	|{ВЫБРАТЬ
	|	ПервоначальныеСведения.НематериальныйАктив.*          КАК НематериальныйАктив,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации КАК СпособНачисления,
	|	МестонахождениеНМА.МОЛ.* КАК МОЛ,
	|	МестонахождениеНМА.Местонахождение.* КАК Подразделение,
	|	СостояниеНМАПрием.Период                           КАК ДатаВводаВЭксплуатацию,
	|	СостояниеНМАСписание.Период                        КАК ДатаСписания,
	|	ПервоначальныеСведения.НачислятьАмортизацию        КАК НачислятьАмортизацию,
	|	ПервоначальныеСведения.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПервоначальныеСведения.СрокПолезногоИспользования  КАК СрокПолезногоИспользования}
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМА.СрезПоследних(&ДатаКон,
	|	                {НематериальныйАктив.* КАК НематериальныйАктив}) КАК ПервоначальныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрНакопления.СтоимостьНМА.ОстаткиИОбороты(
	|			                  &ДатаНач, &ДатаКон, , , 
	|			                  {НематериальныйАктив.* КАК НематериальныйАктив}) КАК СтоимостьНМА
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СтоимостьНМА.НематериальныйАктив
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияНМА.СрезПоследних(&ДатаКон, 
	|			                Состояние = &СостояниеВводВЭксплуатацию 
	|			                {НематериальныйАктив.* КАК НематериальныйАктив}) КАК СостояниеНМАПрием
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СостояниеНМАПрием.НематериальныйАктив}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СостоянияНМА.СрезПоследних(
	|			                &ДатаКон, Состояние = &СостояниеСписание 
	|			                {НематериальныйАктив.* КАК НематериальныйАктив}) КАК СостояниеНМАСписание
	|		ПО ПервоначальныеСведения.НематериальныйАктив = СостояниеНМАСписание.НематериальныйАктив}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.МестонахождениеНМА.СрезПоследних(
	|			                &ДатаКон, 
	|			                {НематериальныйАктив.* КАК НематериальныйАктив}) КАК МестонахождениеНМА
	|		ПО ПервоначальныеСведения.НематериальныйАктив = МестонахождениеНМА.НематериальныйАктив}
	|{ГДЕ
	|	ПервоначальныеСведения.НачислятьАмортизацию  КАК НачислятьАмортизацию,
	|	СостояниеНМАПрием.Период                     КАК ДатаВводаВЭксплуатацию,
	|	СостояниеНМАСписание.Период                  КАК ДатаСписания}
	|
	|СГРУППИРОВАТЬ ПО
	|	ПервоначальныеСведения.НематериальныйАктив,
	|	МестонахождениеНМА.МОЛ,
	|	МестонахождениеНМА.Местонахождение,
	|	СостояниеНМАПрием.Период,
	|	СостояниеНМАСписание.Период,
	|	ПервоначальныеСведения.СпособНачисленияАмортизации,
	|	ПервоначальныеСведения.НематериальныйАктив.Представление
	|{УПОРЯДОЧИТЬ ПО
	|	СпособНачисления,
	|	НематериальныйАктив,
	|	МОЛ,
	|	Подразделение,
	|	ДатаВводаВЭксплуатацию,
	|	ДатаСписания,
	|	ПервоначальнаяСтоимость,
	|	ОстаточнаяСтоимость,
	|	ЛиквидационнаяСтоимость,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьПриход,
	|	СтоимостьРасход,
	|	СтоимостьОборот,
	|	СтоимостьКонечныйОстаток,
	|	АмортизацияНачальныйОстаток,
	|	АмортизацияПриход,
	|	АмортизацияРасход,
	|	АмортизацияОборот,
	|	АмортизацияКонечныйОстаток}
	|ИТОГИ
	|	СУММА(ПервоначальнаяСтоимость),
	|	СУММА(ОстаточнаяСтоимость),
	|	СУММА(ЛиквидационнаяСтоимость),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьПриход),
	|	СУММА(СтоимостьРасход),
	|	СУММА(СтоимостьОборот),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(АмортизацияНачальныйОстаток),
	|	СУММА(АмортизацияПриход),
	|	СУММА(АмортизацияРасход),
	|	СУММА(АмортизацияОборот),
	|	СУММА(АмортизацияКонечныйОстаток)
	|ПО
	|	ОБЩИЕ,
	|	СпособНачисления
	|{ИТОГИ ПО
	|	СпособНачисления,
	|	НематериальныйАктив.*}
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить( "НематериальныйАктив",                         "Нематериальный актив");
	СтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию",                      "Дата принятия к учету");
	СтруктураПредставлениеПолей.Вставить( "ДатаСписания",                                "Дата списания");
	СтруктураПредставлениеПолей.Вставить( "СпособНачисления",                            "Способ начисления амортизации");
	СтруктураПредставлениеПолей.Вставить( "НачислятьАмортизацию",                        "Начислять амортизацию");
	СтруктураПредставлениеПолей.Вставить( "СрокПолезногоИспользования",                  "Срок пол. использования");
	СтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРаботДляВычисленияАмортизации", "Объем работ для амортизации");
	
	ПостроительОтчета.Текст = Текст;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели( "ПервоначальнаяСтоимость",   "Первоначальная стоимость",    Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "ОстаточнаяСтоимость",       "Остаточная стоимость",        Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "ЛиквидационнаяСтоимость",   "Ликвидационн. стоимость",     Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьНачальныйОстаток", "Стоимость на начало периода", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьПриход",           "Стоимость (приход)",          Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьРасход",           "Стоимость (расход)",          Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборот",           "Изменение стоимости",         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьКонечныйОстаток",  "Стоимость на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2");
	
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияНачальныйОстаток", "Амортизация на начало периода", Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияПриход",           "Амортизация (приход)",          Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияРасход",           "Амортизация (расход)",          Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборот",           "Амортизация за период",         Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияКонечныйОстаток",  "Амортизация на конец периода",  Истина, "ЧЦ=15; ЧДЦ=2");
	
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("НематериальныйАктив");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения     = Истина;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший процедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры

ОбщийОтчет.ИмяРегистра = "СтоимостьНМА";
ОбщийОтчет.мНазваниеОтчета = "Ведомость амортизации НМА";
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода = 0;
ОбщийОтчет.мВыбиратьИспользованиеСвойств = Ложь;

#КонецЕсли
